Aliceykr/2026G/STM32/App/Src/GSignalFlow.c
static void GSignalFlow_StartOrRetry(uint32_t now)
{
    /* 仅在屏幕单次测量或USART1连续测量已启用时启动FPGA采集。 */
    if (s_MeasurementEnabled == 0U)
    {
        s_State = G_FLOW_STATE_IDLE;
        return;
    }

    if (s_FpgaOnline == 0U)
    {
        s_FpgaOnline = Fpga_ReadId(&s_FpgaId);
        if (s_FpgaOnline == 0U)
        {
            GSignalFlow_AbortCycle("id", "ID ERR");
            return;
        }
    }

    if (Fpga_StartCapture(0U) == 0U)
    {
        GSignalFlow_AbortCycle("start", "START ERR");
        return;
    }

    memset(&s_Result, 0, sizeof(s_Result));
    memset(&s_Measurement, 0, sizeof(s_Measurement));
    s_HfMedianActive = 0U;
    s_HfMedianCount = 0U;
    s_HfMedianStartTick = now;
    if (s_ActiveMeasurementMode == G_FLOW_MODE_TIME)
    {
        memset(&s_Waveform, 0, sizeof(s_Waveform));
        s_WaveFrameValid = 0U;
        s_TimeFundamentalHz = 0.0f;
    }
    s_CycleStartTick = now;
    s_State = G_FLOW_STATE_WAIT_ANALYSIS;
    s_NextActionTick = now + G_FLOW_STATUS_POLL_MS;
}

static void GSignalFlow_FinishCycle(uint32_t now)
{
    if ((s_ActiveMeasurementMode == G_FLOW_MODE_SERIAL_STREAM) &&
        (s_SerialStreamEnabled != 0U))
    {
        s_MeasurementEnabled = 1U;
        s_State = G_FLOW_STATE_HOLD;
        s_HmiReadyPending = 0U;
        s_NextActionTick = now + GSignalFlow_GetStreamIntervalMs();
        return;
    }

    s_MeasurementEnabled = 0U;
    s_State = G_FLOW_STATE_HOLD;
    if ((s_ActiveMeasurementMode == G_FLOW_MODE_TIME) ||
        (s_ActiveMeasurementMode == G_FLOW_MODE_FREQUENCY))
    {
        s_HmiReadyPending = 1U;

        /* 屏幕单次测量结束后恢复上电自动开启的USART1连续采集。 */
        if (s_SerialStreamEnabled != 0U)
        {
            s_ActiveMeasurementMode = G_FLOW_MODE_SERIAL_STREAM;
            s_MeasurementEnabled = 1U;
            s_NextActionTick = now + GSignalFlow_GetStreamIntervalMs();
        }
    }
}

static void GSignalFlow_AbortCycle(const char *stage,
                                  const char *hmi_status)
{
    GSignalFlow_SendError(stage);

    if ((s_ActiveMeasurementMode == G_FLOW_MODE_SERIAL_STREAM) &&
        (s_SerialStreamEnabled != 0U))
    {
        s_MeasurementEnabled = 1U;
        s_State = G_FLOW_STATE_HOLD;
        s_HmiReadyPending = 0U;
        s_NextActionTick = HAL_GetTick() + G_FLOW_STREAM_RETRY_MS;
        GSignalFlow_SendText(
            "G_STREAM,state=retrying,after_ms=500\r\n");
        return;
    }

    s_MeasurementEnabled = 0U;
    s_State = G_FLOW_STATE_HOLD;
    if (((s_ActiveMeasurementMode == G_FLOW_MODE_TIME) ||
         (s_ActiveMeasurementMode == G_FLOW_MODE_FREQUENCY)) &&
        (hmi_status != NULL))
    {
        s_HmiReadyPending = 0U;
        TjcHmi_SetStatusText(hmi_status);
    }

    /* 屏幕测量失败只报告本次错误，不关闭USART1自动连续采集。 */
    if (s_SerialStreamEnabled != 0U)
    {
        s_ActiveMeasurementMode = G_FLOW_MODE_SERIAL_STREAM;
        s_MeasurementEnabled = 1U;
        s_NextActionTick = HAL_GetTick() + G_FLOW_STREAM_RETRY_MS;
        GSignalFlow_SendText(
            "G_STREAM,state=retrying,after_ms=500\r\n");
    }
}

static void GSignalFlow_HandleSerialCommand(void)
{
    uint8_t byte;

    while (GSerial_ReadByte(&byte) != 0U)
    {
        uint32_t now = HAL_GetTick();

        if ((byte == (uint8_t)'C') || (byte == (uint8_t)'c'))
        {
            if ((s_State != G_FLOW_STATE_IDLE) &&
                (s_State != G_FLOW_STATE_HOLD))
            {
                GSignalFlow_SendText(
                    "G_STREAM,state=busy,cmd=C\r\n");
                continue;
            }

            s_PendingHmiMode = G_FLOW_MODE_NONE;
            s_SerialStreamEnabled = 1U;
            s_ActiveMeasurementMode = G_FLOW_MODE_SERIAL_STREAM;
            s_MeasurementEnabled = 1U;
            s_HmiReadyPending = 0U;
            s_State = G_FLOW_STATE_WAIT_RESTART;
            s_NextActionTick = now;
            GSignalFlow_SendText(
                "G_STREAM,state=running,mode=calibration\r\n");
            continue;
        }

        if ((byte == (uint8_t)'S') || (byte == (uint8_t)'s'))
        {
            uint8_t was_stream =
                ((s_ActiveMeasurementMode == G_FLOW_MODE_SERIAL_STREAM) ||
                 (s_SerialStreamEnabled != 0U)) ? 1U : 0U;

            s_SerialStreamEnabled = 0U;
            if ((s_State == G_FLOW_STATE_IDLE) ||
                (s_State == G_FLOW_STATE_HOLD))
            {
                s_MeasurementEnabled = 0U;
                if (s_ActiveMeasurementMode == G_FLOW_MODE_SERIAL_STREAM)
                {
                    s_ActiveMeasurementMode = G_FLOW_MODE_NONE;
                }
                GSignalFlow_SendText(
                    (was_stream != 0U)
                        ? "G_STREAM,state=stopped\r\n"
                        : "G_STREAM,state=idle\r\n");
            }
            else if (s_ActiveMeasurementMode == G_FLOW_MODE_SERIAL_STREAM)
            {
                GSignalFlow_SendText(
                    "G_STREAM,state=stopping,after=current_frame\r\n");
            }
            continue;
        }

        if (byte == (uint8_t)'?')
        {
            GSignalFlow_SendText(
                "G_STREAM,cmd=C:start_continuous,S:stop,baud=921600,format=8N1\r\n");
        }
    }
}

static void GSignalFlow_HandleCommand(void)
{
    TjcHmiEvent event;
    uint8_t requested_cycles = 0U;
    uint32_t now;

    if (TjcHmi_ReadEvent(&event, &requested_cycles) == 0U)
    {
        return;
    }

    now = HAL_GetTick();

    if (event == TJC_HMI_EVENT_START_MEASUREMENT)
    {
        if ((uint32_t)(now - s_LastStartEventTick) <
            G_FLOW_BUTTON_DEBOUNCE_MS)
        {
            return;
        }
        s_LastStartEventTick = now;

        /* 连续串口帧完成后自动执行排队的屏幕时域任务。 */
        if ((s_State != G_FLOW_STATE_IDLE) &&
            (s_State != G_FLOW_STATE_HOLD))
        {
            if (s_ActiveMeasurementMode == G_FLOW_MODE_SERIAL_STREAM)
            {
                s_PendingHmiMode = G_FLOW_MODE_TIME;
                GSignalFlow_SendText(
                    "G_HMI,event=time,queued=after_stream_frame\r\n");
                return;
            }
            GSignalFlow_SendText("G_HMI,event=time,ignored=busy\r\n");
            return;
        }

        GSignalFlow_StartHmiMeasurement(G_FLOW_MODE_TIME, now);
        return;
    }

