Aliceykr/2026G/STM32/App/Src/GSignalFlow.c
    if (event == TJC_HMI_EVENT_FREQUENCY_MEASUREMENT)
    {
        if ((uint32_t)(now - s_LastFrequencyEventTick) <
            G_FLOW_BUTTON_DEBOUNCE_MS)
        {
            return;
        }
        s_LastFrequencyEventTick = now;

        if ((s_State != G_FLOW_STATE_IDLE) &&
            (s_State != G_FLOW_STATE_HOLD))
        {
            if (s_ActiveMeasurementMode == G_FLOW_MODE_SERIAL_STREAM)
            {
                s_PendingHmiMode = G_FLOW_MODE_FREQUENCY;
                GSignalFlow_SendText(
                    "G_HMI,event=frequency,queued=after_stream_frame\r\n");
                return;
            }
            GSignalFlow_SendText(
                "G_HMI,event=frequency,ignored=busy\r\n");
            return;
        }

        GSignalFlow_StartHmiMeasurement(G_FLOW_MODE_FREQUENCY, now);
        return;
    }

    if (event == TJC_HMI_EVENT_TOGGLE_ALGORITHM)
    {
        char buffer[96];

        if ((uint32_t)(now - s_LastRangeEventTick) <
            G_FLOW_BUTTON_DEBOUNCE_MS)
        {
            return;
        }
        s_LastRangeEventTick = now;
        s_AlgorithmMode =
            (s_AlgorithmMode == G_FLOW_ALGORITHM_OPTIMIZED)
                ? G_FLOW_ALGORITHM_LEGACY_RANDOM
                : G_FLOW_ALGORITHM_OPTIMIZED;

        SpectrumAnalyzer_SetOptimizedAlgorithm(
            GSignalFlow_IsOptimizedAlgorithm());
        TjcHmi_SetAlgorithmOptimized(
            GSignalFlow_IsOptimizedAlgorithm());
        s_HfMedianActive = 0U;
        s_HfMedianCount = 0U;
        memset(s_HfMedianFrames, 0, sizeof(s_HfMedianFrames));
        memset(&s_Result, 0, sizeof(s_Result));
        memset(&s_Measurement, 0, sizeof(s_Measurement));
        s_State = G_FLOW_STATE_WAIT_RESTART;
        s_MeasurementEnabled = 1U;
        s_NextActionTick = now;

        (void)snprintf(
            buffer,
            sizeof(buffer),
            "G_HMI,event=function,algorithm=%s,half_mv=on\r\n",
            (GSignalFlow_IsOptimizedAlgorithm() != 0U)
                ? "optimized" : "random-2958bf3");
        GSignalFlow_SendText(buffer);
        return;
    }

    if (event == TJC_HMI_EVENT_TOGGLE_CYCLES)
    {
        requested_cycles =
            (s_SelectedWaveformCycles == 1U) ? 3U : 1U;
    }

    if ((event == TJC_HMI_EVENT_TOGGLE_CYCLES) ||
        (event == TJC_HMI_EVENT_SET_CYCLES))
    {
        char buffer[64];
        const char *apply_mode;

        if ((uint32_t)(now - s_LastCycleEventTick) <
            G_FLOW_BUTTON_DEBOUNCE_MS)
        {
            return;
        }
        s_LastCycleEventTick = now;

        if (GSignalFlow_SetWaveformCycles(requested_cycles) == 0U)
        {
            return;
        }

        if ((s_ActiveMeasurementMode == G_FLOW_MODE_TIME) &&
            ((s_State == G_FLOW_STATE_WAIT_RESTART) ||
             (s_State == G_FLOW_STATE_WAIT_ANALYSIS) ||
             (s_State == G_FLOW_STATE_WAIT_WAVEFORM)))
        {
            /* b0时域任务中只排队更新s0，不影响任何频域显示。 */
            s_CycleChangePending = 1U;
            apply_mode = "queued";
        }
        else if (s_WaveFrameValid != 0U)
        {
            /* 始终使用最近一次b0缓存的5MSPS帧，只重画s0。 */
            s_ActiveWaveformCycles = s_SelectedWaveformCycles;
            if (GSignalFlow_BuildAndDisplayWaveform(
                    s_ActiveWaveformCycles) != 0U)
            {
                apply_mode = "redraw";
            }
            else
            {
                apply_mode = "error";
            }
        }
        else
        {
            s_ActiveWaveformCycles = s_SelectedWaveformCycles;
            apply_mode = "next";
        }

        (void)snprintf(buffer,
                       sizeof(buffer),
                       "G_HMI,event=cycles,value=%u,apply=%s\r\n",
                       (unsigned int)s_SelectedWaveformCycles,
                       apply_mode);
        GSignalFlow_SendText(buffer);
    }
}

static void GSignalFlow_StartHmiMeasurement(GFlowMeasurementMode mode,
                                            uint32_t now)
{
    s_ActiveMeasurementMode = mode;
    TjcHmi_SetComputeBusy(1U);
    s_HmiBusyUntilTick = now + G_FLOW_HMI_BUSY_MIN_MS;
    s_HmiReadyPending = 0U;
    s_MeasurementEnabled = 1U;

    if (mode == G_FLOW_MODE_TIME)
    {
        GSignalFlow_SendText("G_HMI,event=time\r\n");
        s_ActiveWaveformCycles = s_SelectedWaveformCycles;
        s_CycleChangePending = 0U;
        GSignalFlow_UpdateHmiTimePlaceholders();
        tjc_clear_wave("s0.id", 0);
        tjc_send_string("ref s0");
    }
    else
    {
        GSignalFlow_SendText("G_HMI,event=frequency\r\n");
        GSignalFlow_UpdateHmiFrequencyPlaceholders();
        (void)GSignalFlow_UpdateHmiSpectrum(0U);
    }

    s_State = G_FLOW_STATE_WAIT_RESTART;
    s_NextActionTick = now;
}

static void GSignalFlow_ServicePendingHmiMeasurement(uint32_t now)
{
    GFlowMeasurementMode mode;

    if ((s_PendingHmiMode == G_FLOW_MODE_NONE) ||
        ((s_State != G_FLOW_STATE_IDLE) &&
         (s_State != G_FLOW_STATE_HOLD)))
    {
        return;
    }

    mode = s_PendingHmiMode;
    s_PendingHmiMode = G_FLOW_MODE_NONE;
    GSignalFlow_StartHmiMeasurement(mode, now);
}

static void GSignalFlow_SendText(const char *text)
{
#if G_FLOW_ASCII_DEBUG_ENABLED != 0U
    size_t length;

    if (text == NULL)
    {
        return;
    }

    length = strlen(text);
    if (length > 0xFFFFU)
    {
        length = 0xFFFFU;
    }

    (void)GSerial_Transmit((const uint8_t *)text,
                           (uint16_t)length,
                           G_FLOW_UART_TIMEOUT_MS);
#else
    (void)text;
#endif
}

static void GSignalFlow_SendStartup(void)
{
    char buffer[96];

    (void)snprintf(buffer,
                   sizeof(buffer),
                   "G_FLOW,boot,id=0x%08lX,online=%u,fs=1250000,n=4096\r\n",
                   (unsigned long)s_FpgaId,
                   (unsigned int)s_FpgaOnline);
    GSignalFlow_SendText(buffer);
}

static void GSignalFlow_SendError(const char *stage)
{
    char buffer[96];

    (void)snprintf(buffer,
                   sizeof(buffer),
                   "G_FLOW,error=%s,seq=%lu\r\n",
                   stage,
                   (unsigned long)s_ReportSequence);
    GSignalFlow_SendText(buffer);
}

