Aliceykr/2026G/STM32/App/Src/GSignalFlow.c
    GSignalFlow_SendText(buffer);
    return 1U;
}

static uint8_t GSignalFlow_IsOptimizedAlgorithm(void)
{
    return (s_AlgorithmMode == G_FLOW_ALGORITHM_OPTIMIZED) ? 1U : 0U;
}

static const GMeasurementCalibration *
    GSignalFlow_GetActiveCalibration(void)
{
    return (GSignalFlow_IsOptimizedAlgorithm() != 0U)
        ? GMeasurementCalibration_Get()
        : GMeasurementCalibration_GetLegacy();
}

static uint32_t GSignalFlow_GetStreamIntervalMs(void)
{
    return (GSignalFlow_IsOptimizedAlgorithm() != 0U)
        ? G_FLOW_STREAM_INTERVAL_OPT_MS
        : G_FLOW_STREAM_INTERVAL_LEGACY_MS;
}

static uint8_t GSignalFlow_ShouldUseHfMedian(
    const GMeasurementResult *measurement)
{
    uint8_t component;

    if ((measurement == NULL) ||
        (measurement->valid == 0U) ||
        (measurement->component_count == 0U))
    {
        return 0U;
    }

    for (component = 0U;
         component < measurement->component_count;
         component++)
    {
        const GMeasurementComponent *item =
            &measurement->components[component];

        if ((item->frequency_hz >= G_FLOW_HF_MEDIAN_MIN_HZ) &&
            (item->amplitude_mv <= G_FLOW_HF_MEDIAN_MAX_PEAK_MV))
        {
            return 1U;
        }
    }

    return 0U;
}

static uint8_t GSignalFlow_HfMedianCompatible(
    const GMeasurementResult *measurement)
{
    const GMeasurementResult *reference;
    uint8_t component;

    if ((measurement == NULL) ||
        (s_HfMedianCount == 0U))
    {
        return 1U;
    }

    reference = &s_HfMedianFrames[0];
    if (measurement->component_count != reference->component_count)
    {
        return 0U;
    }
    if ((measurement->fundamental_hz - reference->fundamental_hz >
         G_FLOW_HF_MEDIAN_FREQ_TOL_HZ) ||
        (reference->fundamental_hz - measurement->fundamental_hz >
         G_FLOW_HF_MEDIAN_FREQ_TOL_HZ))
    {
        return 0U;
    }

    for (component = 0U;
         component < measurement->component_count;
         component++)
    {
        if (measurement->components[component].harmonic !=
            reference->components[component].harmonic)
        {
            return 0U;
        }
    }

    return 1U;
}

static void GSignalFlow_StoreHfMedianFrame(
    const GMeasurementResult *measurement)
{
    if ((measurement == NULL) ||
        (s_HfMedianCount >= G_FLOW_HF_MEDIAN_FRAMES))
    {
        return;
    }

    s_HfMedianFrames[s_HfMedianCount] = *measurement;
    s_HfMedianCount++;
}

static void GSignalFlow_FinalizeHfMedian(void)
{
    float values[G_FLOW_HF_MEDIAN_FRAMES];
    uint8_t component;
    uint8_t frame;

    if (s_HfMedianCount != G_FLOW_HF_MEDIAN_FRAMES)
    {
        return;
    }

    s_Measurement = s_HfMedianFrames[G_FLOW_HF_MEDIAN_FRAMES - 1U];

    for (frame = 0U; frame < G_FLOW_HF_MEDIAN_FRAMES; frame++)
    {
        values[frame] = s_HfMedianFrames[frame].fundamental_hz;
    }
    s_Measurement.fundamental_hz = GSignalFlow_Median25(values);

    for (frame = 0U; frame < G_FLOW_HF_MEDIAN_FRAMES; frame++)
    {
        values[frame] = s_HfMedianFrames[frame].upp_mv;
    }
    s_Measurement.upp_mv = GSignalFlow_Median25(values);

    for (frame = 0U; frame < G_FLOW_HF_MEDIAN_FRAMES; frame++)
    {
        values[frame] = s_HfMedianFrames[frame].urms_mv;
    }
    s_Measurement.urms_mv = GSignalFlow_Median25(values);

    for (component = 0U;
         component < s_Measurement.component_count;
         component++)
    {
        for (frame = 0U; frame < G_FLOW_HF_MEDIAN_FRAMES; frame++)
        {
            values[frame] =
                s_HfMedianFrames[frame].components[component].frequency_hz;
        }
        s_Measurement.components[component].frequency_hz =
            GSignalFlow_Median25(values);

        for (frame = 0U; frame < G_FLOW_HF_MEDIAN_FRAMES; frame++)
        {
            values[frame] =
                s_HfMedianFrames[frame].components[component].amplitude_mv;
        }
        s_Measurement.components[component].amplitude_mv =
            GSignalFlow_Median25(values);
    }

    s_HfMedianActive = 0U;
    s_HfMedianCount = 0U;
}

static float GSignalFlow_Median25(const float *values)
{
    float sorted[G_FLOW_HF_MEDIAN_FRAMES];
    uint8_t index;

    memcpy(sorted, values, sizeof(sorted));
    for (index = 1U; index < G_FLOW_HF_MEDIAN_FRAMES; index++)
    {
        float item = sorted[index];
        uint8_t position = index;

        while ((position > 0U) &&
               (sorted[position - 1U] > item))
        {
            sorted[position] = sorted[position - 1U];
            position--;
        }
        sorted[position] = item;
    }

    return sorted[G_FLOW_HF_MEDIAN_FRAMES / 2U];
}

static void GSignalFlow_SendCalibrationTelemetry(void)
{
    char buffer[256];
    char f0_text[24];
    char upp_text[24];
    char urms_text[24];
    float reference_phase_deg = 0.0f;
    uint8_t reference_valid = 0U;
    uint8_t component;
    uint16_t sample_index;
    int16_t raw_min = s_CaptureFrame[0];
    int16_t raw_max = s_CaptureFrame[0];
    int written;

    for (sample_index = 1U;
         sample_index < SPECTRUM_FRAME_LENGTH;
         sample_index++)
    {
        if (s_CaptureFrame[sample_index] < raw_min)
            raw_min = s_CaptureFrame[sample_index];
        if (s_CaptureFrame[sample_index] > raw_max)
            raw_max = s_CaptureFrame[sample_index];
    }

    GSignalFlow_FormatFixed2(s_Measurement.fundamental_hz,
                             f0_text,
                             sizeof(f0_text));
    GSignalFlow_FormatFixed3(s_Measurement.upp_mv,
                             upp_text,
                             sizeof(upp_text));
    GSignalFlow_FormatFixed3(s_Measurement.urms_mv,
                             urms_text,
                             sizeof(urms_text));
    (void)snprintf(buffer,
                   sizeof(buffer),
                   "G_CAL,seq=%lu,f0=%sHz,n=%u,upp=%smV,urms=%smV,t_ms=%lu,raw_min=%d,raw_max=%d,raw_pp=%ld\r\n",
                   (unsigned long)s_ActiveSequence,
                   f0_text,
                   (unsigned int)s_Measurement.component_count,
                   upp_text,
                   urms_text,
                   (unsigned long)s_AnalysisElapsedMs,
                   (int)raw_min,
                   (int)raw_max,
                   (long)((int32_t)raw_max - (int32_t)raw_min));
    GSignalFlow_SendText(buffer);

