Aliceykr/2026G/STM32/App/Src/GSignalFlow.c
    if (field <= 5U)
    {
        uint8_t slot = (uint8_t)(field - 3U);
        const GMeasurementComponent *item = NULL;

        object_name = (field == 3U) ? "t3" :
                      ((field == 4U) ? "t4" : "t5");

        if (slot < s_Measurement.component_count)
        {
            item = &s_Measurement.components[slot];
        }

        if (item != NULL)
        {
            GSignalFlow_FormatFixed3(item->amplitude_mv,
                                     value_text,
                                     sizeof(value_text));
            (void)snprintf(text,
                           sizeof(text),
                           G_FLOW_HMI_HARMONIC_GB2312 "H%u\xA3\xBA%luHz %smV",
                           (unsigned int)item->harmonic,
                           (unsigned long)GSignalFlow_RoundPositive(
                               item->frequency_hz),
                           value_text);
        }
        else
        {
            (void)snprintf(text,
                           sizeof(text),
                           G_FLOW_HMI_HARMONIC_GB2312 "H--\xA3\xBA--");
        }
        tjc_send_txt(object_name, "txt", text);
        return;
    }
}

static void GSignalFlow_UpdateHmiPlaceholders(void)
{
    GSignalFlow_UpdateHmiTimePlaceholders();
    GSignalFlow_UpdateHmiFrequencyPlaceholders();
}

static void GSignalFlow_UpdateHmiTimePlaceholders(void)
{
    tjc_send_txt("t0", "txt", G_FLOW_HMI_FREQUENCY_GB2312 "F\xA3\xBA--");
    tjc_send_txt("t1", "txt", G_FLOW_HMI_VPP_GB2312 "Vpp\xA3\xBA--");
    tjc_send_txt("t2", "txt", G_FLOW_HMI_RMS_GB2312 "Vrms\xA3\xBA--");
}

static void GSignalFlow_UpdateHmiFrequencyPlaceholders(void)
{
    uint8_t field;

    for (field = 3U; field <= 5U; field++)
    {
        char object_name[3] = {'t', (char)('0' + field), '\0'};
        char text[64];

        (void)snprintf(text,
                       sizeof(text),
                       G_FLOW_HMI_HARMONIC_GB2312 "H--\xA3\xBA--");
        tjc_send_txt(object_name, "txt", text);
    }
}

static void GSignalFlow_UpdateHmiNoSignal(void)
{
    if (s_ActiveMeasurementMode == G_FLOW_MODE_TIME)
    {
        GSignalFlow_UpdateHmiTimePlaceholders();
        tjc_clear_wave("s0.id", 0);
        tjc_send_string("ref s0");
    }
    else if (s_ActiveMeasurementMode == G_FLOW_MODE_FREQUENCY)
    {
        GSignalFlow_UpdateHmiFrequencyPlaceholders();
        (void)GSignalFlow_UpdateHmiSpectrum(0U);
    }
}

static uint8_t GSignalFlow_UpdateHmiSpectrum(uint8_t signal_valid)
{
    uint16_t display_points = s_SpectrumDisplayPoints;
    uint8_t width_ready = 1U;

    if (signal_valid == 0U)
    {
        /*
         * cle是普通ASCII命令，不存在addt透明数据与屏幕启动过程错位的
         * 风险。启动、无信号和新一轮测量开始时保持频谱窗口完全空白。
         */
        tjc_clear_wave("s1.id", 0);
        tjc_send_string("ref s1");
        return 1U;
    }

    if (display_points == 0U)
    {
        if (TjcHmi_GetComponentWidth("s1", &display_points) != 0U)
        {
            s_SpectrumDisplayPoints = display_points;
        }
        else
        {
            display_points = G_FLOW_SPECTRUM_FALLBACK_POINTS;
            width_ready = 0U;
        }
    }

    if (display_points > G_FLOW_SPECTRUM_MAX_POINTS)
    {
        display_points = G_FLOW_SPECTRUM_MAX_POINTS;
    }

    if (GSignalFlow_BuildQualitativeSpectrum(display_points) == 0U)
    {
        memset(s_SpectrumDisplay,
               G_FLOW_SPECTRUM_VERTICAL_OFFSET,
               display_points);
    }

    /*
     * ref s1先重绘波形控件背景，清除旧版本用xstr画出的谐波文字；
     * 新版本不再在频谱区域绘制任何文字标注。
     */
    tjc_send_string("ref s1");
    tjc_clear_wave("s1.id", 0);
    if (tjc_send_wave("s1.id",
                      0,
                      s_SpectrumDisplay,
                      display_points) == 0U)
    {
        return 0U;
    }
    if (width_ready != 0U)
    {
        return 1U;
    }

    return 0U;
}

static uint8_t GSignalFlow_BuildQualitativeSpectrum(uint16_t point_count)
{
    float maximum_amplitude = 0.0f;
    float minimum_frequency = (float)G_FLOW_SPECTRUM_MAX_HZ;
    float maximum_frequency = (float)G_FLOW_SPECTRUM_MIN_HZ;
    float group_center_frequency;
    uint16_t half_width;
    uint8_t component;

    if ((point_count < 2U) || (s_Result.valid == 0U))
    {
        return 0U;
    }

    memset(s_SpectrumDisplay,
           G_FLOW_SPECTRUM_VERTICAL_OFFSET,
           point_count);

    for (component = 0U;
         component < s_Result.component_count;
         component++)
    {
        const SpectrumComponent *peak = &s_Result.components[component];

        if ((peak->frequency_hz >= (float)G_FLOW_SPECTRUM_MIN_HZ) &&
            (peak->frequency_hz <= (float)G_FLOW_SPECTRUM_MAX_HZ) &&
            (peak->amplitude_codes > 0.0f))
        {
            if (peak->amplitude_codes > maximum_amplitude)
            {
                maximum_amplitude = peak->amplitude_codes;
            }
            if (peak->frequency_hz < minimum_frequency)
            {
                minimum_frequency = peak->frequency_hz;
            }
            if (peak->frequency_hz > maximum_frequency)
            {
                maximum_frequency = peak->frequency_hz;
            }
        }
    }

    if (maximum_amplitude <= 0.0f)
    {
        return 0U;
    }

    group_center_frequency =
        (minimum_frequency + maximum_frequency) * 0.5f;

    half_width = (uint16_t)(point_count / 256U);
    if (half_width < 2U)
    {
        half_width = 2U;
    }
    else if (half_width > 4U)
    {
        half_width = 4U;
    }

    /*
     * 绘制检测到的最多三个实际分量，谐波次数不限于H1~H3。
     * 峰组的最低/最高频率中点平移到视窗中心，频率到像素仍使用
     * 10~500kHz的固定比例尺，所以各峰之间的距离比例完全不变。
     * 淘晶驰
     * addt数据在当前s1控件上的显示方向与数组索引相反，因此这里
     * 反向写入数组，保证屏幕实际从左到右按频率由低到高排列。
     * 峰高按各谐波幅值相对最强分量线性缩放，因此顺序、间隔和
     * 高度关系都保持定性比例，同时不会混入FFT底噪和非谐波毛刺。
     */
    for (component = 0U;
         component < s_Result.component_count;
         component++)
    {
        const SpectrumComponent *peak = &s_Result.components[component];

        if ((peak->frequency_hz >= (float)G_FLOW_SPECTRUM_MIN_HZ) &&
            (peak->frequency_hz <= (float)G_FLOW_SPECTRUM_MAX_HZ) &&
            (peak->amplitude_codes > 0.0f))
        {
            float center_position =
                ((float)(point_count - 1U) * 0.5f) -
                ((peak->frequency_hz - group_center_frequency) *
                 (float)(point_count - 1U) /
                 (float)(G_FLOW_SPECTRUM_MAX_HZ -
                         G_FLOW_SPECTRUM_MIN_HZ));
            uint16_t center;
            uint32_t height = GSignalFlow_RoundPositive(
                (peak->amplitude_codes / maximum_amplitude) *
                (float)(G_FLOW_SPECTRUM_PEAK_VALUE -
                        G_FLOW_SPECTRUM_VERTICAL_OFFSET));
            int32_t offset;

            if (center_position < 0.0f)
            {
                center_position = 0.0f;
            }
            else if (center_position > (float)(point_count - 1U))
            {
                center_position = (float)(point_count - 1U);
            }
            center = (uint16_t)(center_position + 0.5f);

            if (height < G_FLOW_SPECTRUM_MIN_PEAK_HEIGHT)
            {
                height = G_FLOW_SPECTRUM_MIN_PEAK_HEIGHT;
            }
            if (height > (G_FLOW_SPECTRUM_PEAK_VALUE -
                          G_FLOW_SPECTRUM_VERTICAL_OFFSET))
            {
                height = G_FLOW_SPECTRUM_PEAK_VALUE -
                         G_FLOW_SPECTRUM_VERTICAL_OFFSET;
            }

            for (offset = -(int32_t)half_width;
                 offset <= (int32_t)half_width;
                 offset++)
            {
                int32_t index = (int32_t)center + offset;

                if ((index >= 0) && (index < (int32_t)point_count))
                {
                    uint32_t distance = (offset < 0)
                        ? (uint32_t)(-offset) : (uint32_t)offset;
                    uint32_t local_height =
                        (height *
                         ((uint32_t)half_width + 1UL - distance) +
                         (uint32_t)half_width / 2UL) /
                        ((uint32_t)half_width + 1UL);
                    uint32_t value =
                        G_FLOW_SPECTRUM_VERTICAL_OFFSET + local_height;

                    if (value > s_SpectrumDisplay[index])
                    {
                        s_SpectrumDisplay[index] = (uint8_t)value;
                    }
                }
            }
        }
    }

